#Chapter 05 _ JooSeong

##5.1 pandas 자료구조 소개

### 5.1.1 Series

In [1]:
from pandas import Series, DataFrame
import pandas as pd

In [2]:
obj = Series([4,7,-5,3])

In [3]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [4]:
obj.values

array([ 4,  7, -5,  3])

In [5]:
obj.index

Int64Index([0, 1, 2, 3], dtype='int64')

In [6]:
obj2=Series([4,7,-5,3], index=['d','b','a','c'])

In [7]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [8]:
obj2['a']

-5

In [9]:
obj[['c','a','d']]

c   NaN
a   NaN
d   NaN
dtype: float64

In [10]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [11]:
obj2[obj2 > 0]

d    4
b    7
c    3
dtype: int64

In [12]:
obj2 * 2

d     8
b    14
a   -10
c     6
dtype: int64

In [13]:
import numpy as np
np.exp(obj2)

d      54.598150
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [14]:
'b' in obj2

True

In [15]:
'e' in obj2

False

In [16]:
sdata = {'Ohio':30555,'Texas':71000,'Oregon':16000,'Utah':5000}

In [17]:
obj3=Series(sdata)

In [18]:
obj3

Ohio      30555
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [19]:
states=['California','Ohio','Oregon','Texas']

In [20]:
obj4=Series(sdata,index=states)

In [21]:
obj4

California      NaN
Ohio          30555
Oregon        16000
Texas         71000
dtype: float64

In [22]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [23]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [24]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [25]:
obj3

Ohio      30555
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [26]:
obj4

California      NaN
Ohio          30555
Oregon        16000
Texas         71000
dtype: float64

In [27]:
obj3+obj4

California       NaN
Ohio           61110
Oregon         32000
Texas         142000
Utah             NaN
dtype: float64

In [28]:
obj4.name='population'

In [29]:
obj4.index.name='state'

In [30]:
obj4

state
California      NaN
Ohio          30555
Oregon        16000
Texas         71000
Name: population, dtype: float64

In [31]:
obj.index=['Bob','Steve','Jeff','Ryan']

In [32]:
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

### 5.1.2 DataFrame

In [33]:
data={'state':['Ohio','Ohio','Ohio','Nevada','Nevada'],
     'year' : [2000,2001,2002,2001,2002],
     'pop':[1.5,1.7,3.6,2.4,2.9]}

In [34]:
frame=DataFrame(data)

In [35]:
frame

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [36]:
DataFrame(data,columns=['year','state','pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [37]:
frame2=DataFrame(data,columns=['year','state','pop','debt'],index=['one','two','three','four','five'])

In [38]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [39]:
frame2.columns

Index([u'year', u'state', u'pop', u'debt'], dtype='object')

In [40]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [41]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [42]:
frame2.ix['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [43]:
frame2['debt'] = 16.5

In [44]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [45]:
frame2['debt']=np.arange(5.)

In [46]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5     0
two    2001    Ohio  1.7     1
three  2002    Ohio  3.6     2
four   2001  Nevada  2.4     3
five   2002  Nevada  2.9     4

In [47]:
val=Series([-1.2,-1.5,-1.7],index=['two','four','five'])

In [48]:
frame2['debt']=val

In [49]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [50]:
frame2['eastern'] = frame2.state == 'Ohio'

In [51]:
frame2

       year   state  pop  debt eastern
one    2000    Ohio  1.5   NaN    True
two    2001    Ohio  1.7  -1.2    True
three  2002    Ohio  3.6   NaN    True
four   2001  Nevada  2.4  -1.5   False
five   2002  Nevada  2.9  -1.7   False

In [52]:
del frame2['eastern']

In [53]:
frame2.columns

Index([u'year', u'state', u'pop', u'debt'], dtype='object')

In [54]:
pop = {'Nevada':{2001:2.4,2002:2.9},'Ohio':{2000:1.5,2001:1.7,2002:3.6}}

In [55]:
frame3=DataFrame(pop)

In [56]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [57]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [58]:
DataFrame(pop,index=[2001,2002,2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [59]:
pdata={'Ohio':frame3['Ohio'][:-1],'Nevada':frame3['Nevada'][:2]}

In [60]:
DataFrame(pdata)

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7

In [61]:
frame3.index.name='year';frame3.columns.name='state'

In [62]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [63]:
frame3.values

array([[ nan,  1.5],
       [ 2.4,  1.7],
       [ 2.9,  3.6]])

In [64]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7]], dtype=object)

### 5.1.3 색인 객체

In [65]:
obj = Series(range(3),index=['a','b','c'])

In [66]:
index=obj.index

In [67]:
index

Index([u'a', u'b', u'c'], dtype='object')

In [68]:
index[1:]

Index([u'b', u'c'], dtype='object')

In [69]:
index[1]='d'

TypeError: Indexes does not support mutable operations

In [70]:
index = pd.Index(np.arange(3))

In [71]:
obj2=Series([1.5,-2.5,0],index=index)

In [72]:
obj2.index is index

True

In [73]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [74]:
'Ohio' in frame3.columns

True

In [75]:
2003 in frame3.index

False

## 핵심 기능

### 5.2.1 재색인

In [76]:
obj = Series([4.5,7.2,-5.3,3.6],index=['d','b','a','c'])

In [77]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [78]:
obj2=obj.reindex(['a','b','c','d','e'])

In [79]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [80]:
obj.reindex(['a','b','c','d','e'],fill_value=0)

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [81]:
obj3=Series(['blue','purple','yellow'], index=[0,2,4])

In [82]:
obj3.reindex(range(6),method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [83]:
frame=DataFrame(np.arange(9).reshape((3,3)),index=['a','c','d'],columns=['Ohio','Texas','California'])

In [84]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [85]:
frame2=frame.reindex(['a','b','c','d'])

In [86]:
frame2

   Ohio  Texas  California
a     0      1           2
b   NaN    NaN         NaN
c     3      4           5
d     6      7           8

In [87]:
states=['Texas','Utah','California']

In [88]:
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [89]:
frame.reindex(index=['a','b','c','d'],method='ffill',columns=states)

   Texas  Utah  California
a      1   NaN           2
b      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [90]:
frame.ix[['a','b','c','d'],states]

   Texas  Utah  California
a      1   NaN           2
b    NaN   NaN         NaN
c      4   NaN           5
d      7   NaN           8

### 5.2.2 하나의 로우 또는 컬럼 삭제하기

In [91]:
obj=Series(np.arange(5.),index=['a','b','c','d','e'])

In [92]:
new_obj = obj.drop('c')

In [93]:
new_obj

a    0
b    1
d    3
e    4
dtype: float64

In [94]:
obj.drop(['d','c'])

a    0
b    1
e    4
dtype: float64

In [95]:
data=DataFrame(np.arange(16).reshape((4,4)),index=['Ohio','Colorado','Utah','New York'],columns=['one','two','three','four'])

In [96]:
data.drop(['Colorado','Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [97]:
data.drop('two',axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [98]:
data.drop(['two','four'],axis=1)

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

### 색인하기, 선택하기, 거르기

In [99]:
obj = Series(np.arange(4.),index=['a','b','c','d'])

In [100]:
obj['b']

1.0

In [101]:
obj[1]

1.0

In [102]:
obj[2:4]

c    2
d    3
dtype: float64

In [103]:
obj[['b','a','d']]

b    1
a    0
d    3
dtype: float64

In [104]:
obj[[1,3]]

b    1
d    3
dtype: float64

In [105]:
obj[obj<2]

a    0
b    1
dtype: float64

In [106]:
obj['b':'c']

b    1
c    2
dtype: float64

In [107]:
obj['b':'c']=5

In [108]:
obj

a    0
b    5
c    5
d    3
dtype: float64

In [109]:
data=DataFrame(np.arange(16).reshape((4,4)),index=['Ohio','Colorado','Utah','New York'],columns=['one','two','three','four'])

In [110]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [111]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [112]:
data[['three','one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [113]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [114]:
data[data['three']>5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [115]:
data<5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [116]:
data[data<5]=0

In [117]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [118]:
data.ix[['Colorad','Utah'],[3,0,1]]

         four  one  two
Colorad   NaN  NaN  NaN
Utah       11    8    9

In [119]:
data.ix[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [120]:
data.ix[:'Utah','two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int64

In [121]:
data.ix[data.three>5,:3]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

계속....

### 5.2.4 산술연산과 데이터 정렬

In [122]:
s1 = Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = Series([-2.1, 3.6, -1.5,4, 3.1], index=['a', 'c',  'e', 'f', 'g'])
print s1
print s2

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64
a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [123]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [124]:
df1 = DataFrame(np.arange(9.).reshape((3,3)), columns=list('bcd'),index=['Ohio','Texas','Colorado'])
df2 = DataFrame(np.arange(12.).reshape((4,3)), columns=list('bde'),index=['Utah','Ohio','Texas','Oregon'])
df1

          b  c  d
Ohio      0  1  2
Texas     3  4  5
Colorado  6  7  8

In [125]:
df2

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [126]:
df1+df2

           b   c   d   e
Colorado NaN NaN NaN NaN
Ohio       3 NaN   6 NaN
Oregon   NaN NaN NaN NaN
Texas      9 NaN  12 NaN
Utah     NaN NaN NaN NaN

In [130]:
df1=DataFrame(np.arange(12.).reshape((3,4)),columns=list('abcd'))
df2=DataFrame(np.arange(20.).reshape((4,5)),columns=list('abcde'))
df1

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [131]:
df2

    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [132]:
df1+df2

    a   b   c   d   e
0   0   2   4   6 NaN
1   9  11  13  15 NaN
2  18  20  22  24 NaN
3 NaN NaN NaN NaN NaN

In [133]:
df1.add(df2,fill_value=0)

    a   b   c   d   e
0   0   2   4   6   4
1   9  11  13  15   9
2  18  20  22  24  14
3  15  16  17  18  19

In [134]:
df1.reindex(columns=df2.columns,fill_value=0)

   a  b   c   d  e
0  0  1   2   3  0
1  4  5   6   7  0
2  8  9  10  11  0

### DataFrame과 Series 간의 연산

In [135]:
arr=np.arange(12.).reshape((3,4))

In [136]:
arr

array([[  0.,   1.,   2.,   3.],
       [  4.,   5.,   6.,   7.],
       [  8.,   9.,  10.,  11.]])

In [137]:
arr[0]

array([ 0.,  1.,  2.,  3.])

In [138]:
arr-arr[0]

array([[ 0.,  0.,  0.,  0.],
       [ 4.,  4.,  4.,  4.],
       [ 8.,  8.,  8.,  8.]])

In [140]:
frame = DataFrame(np.arange(12.).reshape((4,3)), columns=list('bde'), index=['Utah', 'Ohio','Texas', 'Oregon'])
series = frame.ix[1]
frame

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [141]:
series

b    3
d    4
e    5
Name: Ohio, dtype: float64

In [142]:
frame - series

        b  d  e
Utah   -3 -3 -3
Ohio    0  0  0
Texas   3  3  3
Oregon  6  6  6

In [143]:
series2 = Series(range(3), index =['b', 'e', 'f'])
series2

b    0
e    1
f    2
dtype: int64

In [144]:
frame + series2

        b   d   e   f
Utah    0 NaN   3 NaN
Ohio    3 NaN   6 NaN
Texas   6 NaN   9 NaN
Oregon  9 NaN  12 NaN

In [145]:
series3 = frame['d']
frame

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [146]:
frame.sub(series3,axis=0)

        b  d  e
Utah   -1  0  1
Ohio   -1  0  1
Texas  -1  0  1
Oregon -1  0  1

### 5.2.5 함수 적용과 매핑

In [147]:
frame = DataFrame(np.random.randn(4, 3), columns=list('bde'), index = ['Utah', 'Ohio', 'Texas', 'Oregon'])

In [148]:
frame

               b         d         e
Utah   -1.113542  1.195278  0.126835
Ohio    0.399957 -0.554504  1.323405
Texas  -1.972206  1.045782 -1.680390
Oregon -0.040173 -1.335383  0.037799

In [149]:
np.abs(frame)

               b         d         e
Utah    1.113542  1.195278  0.126835
Ohio    0.399957  0.554504  1.323405
Texas   1.972206  1.045782  1.680390
Oregon  0.040173  1.335383  0.037799

In [150]:
f =  lambda  x : x.max() - x.min()

In [152]:
frame.apply(f)

b    2.372162
d    2.530661
e    3.003795
dtype: float64

In [153]:
frame.apply(f,1)

Utah      2.308820
Ohio      1.877909
Texas     3.017987
Oregon    1.373182
dtype: float64

In [154]:
def f(x) :
    return Series([x.min(), x.max()], index=['min','max'])

In [155]:
frame.apply(f)

            b         d         e
min -1.972206 -1.335383 -1.680390
max  0.399957  1.195278  1.323405

In [201]:
format = lambda x: '%.2f' %x

In [200]:
frame.applymap(format)

       a       b       c
0  0.000   4.300  -2.000
1  1.000   7.000   5.000
2  0.000  -3.000   8.000
3  1.000   2.000  -2.500

In [158]:
frame['e'].map(format)

Utah       0.13
Ohio       1.32
Texas     -1.68
Oregon     0.04
Name: e, dtype: object

### 5.2.6 정렬과 순위

In [159]:
obj = Series(range(4), index=['d', 'a', 'b', 'c'])
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [160]:
frame = DataFrame (np.arange(8).reshape((2,4)), index =['three', 'one'], columns=['d', 'a', 'b', 'c'])

In [161]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [162]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [163]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [164]:
obj = Series([4, 7, -3, 2])
obj.order()

2   -3
3    2
0    4
1    7
dtype: int64

In [165]:
obj = Series([4, np.nan, 7, np.nan, -3, 2])
obj.order()

4    -3
5     2
0     4
2     7
1   NaN
3   NaN
dtype: float64

In [166]:
frame = DataFrame({'b': [4,7,-3,2], 'a':[0,1,0,1]})
frame

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

In [167]:
frame.sort_index(by='b')

   a  b
2  0 -3
3  1  2
0  0  4
1  1  7

In [168]:
frame.sort_index(by=['a','b'])

   a  b
2  0 -3
0  0  4
3  1  2
1  1  7

In [169]:
obj = Series([7, -5, 7, 4, 2, 0, 4])
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [170]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [171]:
obj.rank(method='first')

0    6
1    1
2    7
3    4
4    3
5    2
6    5
dtype: float64

In [172]:
obj.rank(ascending=False, method='max')

0    2
1    7
2    2
3    4
4    5
5    6
6    4
dtype: float64

In [173]:
frame = DataFrame({'b': [4.3, 7, -3, 2], 'a' : [0,1,0,1], 'c': [-2,5,8,-2.5]})
frame

   a    b    c
0  0  4.3 -2.0
1  1  7.0  5.0
2  0 -3.0  8.0
3  1  2.0 -2.5

In [174]:
frame.rank(axis=1)

   a  b  c
0  2  3  1
1  1  3  2
2  2  1  3
3  2  3  1

### 5.2.7 중복색인

In [175]:
obj = Series(range(5), index= ['a', 'a','b','b','c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [176]:
obj.index.is_unique

False

In [177]:
obj['a']

a    0
a    1
dtype: int64

In [178]:
obj['c']

4

In [179]:
df = DataFrame(np.random.randn(4,3), index =['a', 'a', 'b', 'b'])
df

          0         1         2
a  0.890717 -0.570437  1.537510
a  0.516891  0.839407  0.356774
b  0.929973 -0.147664 -0.442321
b -0.210365  0.374356  1.279462

In [180]:
df.ix['b']

          0         1         2
b  0.929973 -0.147664 -0.442321
b -0.210365  0.374356  1.279462

## 5.3 기술통계 계산과 요약

In [181]:
df = DataFrame([[1.4, np.nan], [7.1, -4.5],[np.nan, np.nan], [0.75, -1.3]], index=['a','b','c','d'],columns=['one', 'two'])

In [182]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [183]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [184]:
df.sum(axis=1)

a    1.40
b    2.60
c     NaN
d   -0.55
dtype: float64

In [185]:
df.mean(axis=1, skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [186]:
df.idxmax()

one    b
two    d
dtype: object

In [187]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [188]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [189]:
obj=Series(['a','a','b','c']*4)

In [190]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

### 5.3.1 상관관계와 공분산

In [191]:
import pandas.io.data as web

all_data = {}
for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']:
    all_data[ticker] = web.get_data_yahoo(ticker)

price = DataFrame({tic: data['Adj Close']
                   for tic, data in all_data.iteritems()})
volume = DataFrame({tic: data['Volume']
                    for tic, data in all_data.iteritems()})

In [192]:
returns = price.pct_change()
returns.tail()

                AAPL      GOOG       IBM      MSFT
Date
2015-07-23 -0.000479 -0.026914  0.008606  0.012516
2015-07-24 -0.005273 -0.032160 -0.012243 -0.003687
2015-07-27 -0.013896  0.005934 -0.004257 -0.012843
2015-07-28  0.004969  0.001180  0.006161 -0.000220
2015-07-29 -0.003161  0.006258  0.006498  0.020953

In [193]:
returns.MSFT.corr(returns.IBM)

0.49531082724680586

In [194]:
returns.MSFT.cov(returns.IBM)

8.3272144070349507e-05

In [195]:
returns.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.276816  0.381249  0.351264
GOOG  0.276816  1.000000  0.319552  0.375430
IBM   0.381249  0.319552  1.000000  0.495311
MSFT  0.351264  0.375430  0.495311  1.000000

In [202]:
returns.cov()

          AAPL      GOOG       IBM      MSFT
AAPL  0.000275  0.000061  0.000074  0.000083
GOOG  0.000061  0.000251  0.000058  0.000084
IBM   0.000074  0.000058  0.000138  0.000083
MSFT  0.000083  0.000084  0.000083  0.000204

In [203]:
returns.corrwith(returns.IBM)

AAPL    0.381249
GOOG    0.319552
IBM     1.000000
MSFT    0.495311
dtype: float64

In [204]:
returns.corrwith(volume)

AAPL   -0.092393
GOOG    0.226219
IBM    -0.183959
MSFT   -0.097935
dtype: float64

### 5.3.2 유일 값, 값 세기, 멤버십

In [205]:
obj = Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [206]:
uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [207]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [208]:
pd.value_counts(obj.values, sort=False)

a    3
c    3
b    2
d    1
dtype: int64

In [209]:
mask = obj.isin(['b', 'c'])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [210]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [211]:
data = DataFrame({'Qu1': [1, 3, 4, 3, 4],
                  'Qu2': [2, 3, 1, 2, 3],
                  'Qu3': [1, 5, 2, 4, 4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [212]:
result = data.apply(pd.value_counts).fillna(0)
result

   Qu1  Qu2  Qu3
1    1    1    1
2    0    2    1
3    2    2    0
4    2    0    2
5    0    0    1

## 5.4 누락된 데이터 처리하기

In [214]:
string_data = Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [215]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [216]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

###  5.4.1 누락된 데이터 골라내기

In [217]:
from numpy import nan as NA
data = Series([1, NA, 3.5, NA, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [218]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [219]:
data = DataFrame([[1., 6.5, 3.], [1., NA, NA],
                  [NA, NA, NA], [NA, 6.5, 3.]])
cleaned = data.dropna()
data

    0    1   2
0   1  6.5   3
1   1  NaN NaN
2 NaN  NaN NaN
3 NaN  6.5   3

In [220]:
cleaned

   0    1  2
0  1  6.5  3

In [221]:
data.dropna(how='all')

    0    1   2
0   1  6.5   3
1   1  NaN NaN
3 NaN  6.5   3

In [222]:
data[4] = NA
data

    0    1   2   4
0   1  6.5   3 NaN
1   1  NaN NaN NaN
2 NaN  NaN NaN NaN
3 NaN  6.5   3 NaN

In [223]:
data.dropna(axis=1, how='all')

    0    1   2
0   1  6.5   3
1   1  NaN NaN
2 NaN  NaN NaN
3 NaN  6.5   3

In [224]:
df = DataFrame(np.random.randn(7, 3))
df.ix[:4, 1] = NA; df.ix[:2, 2] = NA
df

          0         1         2
0 -1.539823       NaN       NaN
1 -0.674044       NaN       NaN
2  0.165618       NaN       NaN
3  1.208630       NaN -0.453495
4 -0.298025       NaN -0.361509
5 -0.944360  0.415580  1.274694
6  0.446018  0.500853  0.888259

In [225]:
df.dropna(thresh=2)

          0         1         2
3  1.208630       NaN -0.453495
4 -0.298025       NaN -0.361509
5 -0.944360  0.415580  1.274694
6  0.446018  0.500853  0.888259

### 5.4.2 누락된 값 채우기

In [226]:
df.fillna(0)

          0         1         2
0 -1.539823  0.000000  0.000000
1 -0.674044  0.000000  0.000000
2  0.165618  0.000000  0.000000
3  1.208630  0.000000 -0.453495
4 -0.298025  0.000000 -0.361509
5 -0.944360  0.415580  1.274694
6  0.446018  0.500853  0.888259

In [227]:
df.fillna({1: 0.5, 2: -1})

          0         1         2
0 -1.539823  0.500000 -1.000000
1 -0.674044  0.500000 -1.000000
2  0.165618  0.500000 -1.000000
3  1.208630  0.500000 -0.453495
4 -0.298025  0.500000 -0.361509
5 -0.944360  0.415580  1.274694
6  0.446018  0.500853  0.888259

In [228]:
_ = df.fillna(0, inplace=True)
df

          0         1         2
0 -1.539823  0.000000  0.000000
1 -0.674044  0.000000  0.000000
2  0.165618  0.000000  0.000000
3  1.208630  0.000000 -0.453495
4 -0.298025  0.000000 -0.361509
5 -0.944360  0.415580  1.274694
6  0.446018  0.500853  0.888259

In [229]:
df = DataFrame(np.random.randn(6, 3))
df.ix[2:, 1] = NA; df.ix[4:, 2] = NA
df

          0         1         2
0  0.770633 -1.076440 -0.393953
1  0.044080 -0.158687 -0.384944
2 -0.286886       NaN  0.008541
3 -0.171970       NaN  1.168766
4  1.041313       NaN       NaN
5 -0.239252       NaN       NaN

In [230]:
df.fillna(method='ffill')

          0         1         2
0  0.770633 -1.076440 -0.393953
1  0.044080 -0.158687 -0.384944
2 -0.286886 -0.158687  0.008541
3 -0.171970 -0.158687  1.168766
4  1.041313 -0.158687  1.168766
5 -0.239252 -0.158687  1.168766

In [231]:
df.fillna(method='ffill',limit=2)

          0         1         2
0  0.770633 -1.076440 -0.393953
1  0.044080 -0.158687 -0.384944
2 -0.286886 -0.158687  0.008541
3 -0.171970 -0.158687  1.168766
4  1.041313       NaN  1.168766
5 -0.239252       NaN  1.168766

In [232]:
data = Series([1., NA, 3.5, NA, 7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

### 5.5 계층적 색인

In [233]:
data = Series(np.random.randn(10),
              index=[['a', 'a', 'a', 'b', 'b', 'b', 'c', 'c', 'd', 'd'],
                     [1, 2, 3, 1, 2, 3, 1, 2, 2, 3]])
data

a  1    0.104916
   2   -1.058569
   3   -0.334201
b  1   -1.135170
   2   -0.034239
   3   -0.519562
c  1    1.127007
   2   -1.463019
d  2   -0.224404
   3   -0.467293
dtype: float64

In [234]:
data.index

MultiIndex(levels=[[u'a', u'b', u'c', u'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [235]:
data['b']

1   -1.135170
2   -0.034239
3   -0.519562
dtype: float64

In [236]:
data['b':'c']

b  1   -1.135170
   2   -0.034239
   3   -0.519562
c  1    1.127007
   2   -1.463019
dtype: float64

In [237]:
data.ix[['b', 'd']]

b  1   -1.135170
   2   -0.034239
   3   -0.519562
d  2   -0.224404
   3   -0.467293
dtype: float64

In [238]:
data[:, 2]

a   -1.058569
b   -0.034239
c   -1.463019
d   -0.224404
dtype: float64

In [239]:
data.unstack()

          1         2         3
a  0.104916 -1.058569 -0.334201
b -1.135170 -0.034239 -0.519562
c  1.127007 -1.463019       NaN
d       NaN -0.224404 -0.467293

In [240]:
data.unstack().stack()

a  1    0.104916
   2   -1.058569
   3   -0.334201
b  1   -1.135170
   2   -0.034239
   3   -0.519562
c  1    1.127007
   2   -1.463019
d  2   -0.224404
   3   -0.467293
dtype: float64

In [241]:
frame = DataFrame(np.arange(12).reshape((4, 3)),
                  index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                  columns=[['Ohio', 'Ohio', 'Colorado'],
                           ['Green', 'Red', 'Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [242]:
frame.index.names = ['key1', 'key2']
frame.columns.names = ['state', 'color']
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [243]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

### 5.5.1 계층 순서 바꾸고 정렬하기

In [244]:
frame.swaplevel('key1', 'key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [245]:
frame.swaplevel(0, 1).sortlevel(0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

In [246]:
frame.sortlevel(1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

### 5.5.2 단계별 요약통계

In [247]:
frame.sum(level='key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [248]:
frame.sum(level='color', axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

### 5.5.3 DataFrame의 칼럼 사용하기

In [249]:
frame = DataFrame({'a': range(7), 'b': range(7, 0, -1),
                   'c': ['one', 'one', 'one', 'two', 'two', 'two', 'two'],
                   'd': [0, 1, 2, 0, 1, 2, 3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [250]:
frame2 = frame.set_index(['c', 'd'])
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [251]:
frame.set_index(['c', 'd'], drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [252]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

##  5.6 pandas와 관련된 기타 주제

### 5.6.1 정수 색인

In [253]:
ser = Series(np.arange(3.))
ser

0    0
1    1
2    2
dtype: float64

In [254]:
ser

0    0
1    1
2    2
dtype: float64

In [255]:
ser2 = Series(np.arange(3.), index=['a', 'b', 'c'])
ser2[-1]

2.0

In [256]:
ser.ix[:1]

0    0
1    1
dtype: float64

In [257]:
ser3 = Series(range(3), index=[-5, 1, 3])
ser3.iget_value(2)

2

In [258]:
frame = DataFrame(np.arange(6).reshape((3, 2)), index=[2, 0, 1])
frame.irow(2)

0    4
1    5
Name: 1, dtype: int64

### Panel 데이터

In [261]:
import pandas.io.data as web

pdata = pd.Panel(dict((stk, web.get_data_yahoo(stk))
                       for stk in ['AAPL', 'GOOG', 'MSFT', 'DELL']))

In [262]:
pdata

<class 'pandas.core.panel.Panel'>
Dimensions: 4 (items) x 1422 (major_axis) x 6 (minor_axis)
Items axis: AAPL to MSFT
Major_axis axis: 2010-01-04 00:00:00 to 2015-07-29 00:00:00
Minor_axis axis: Open to Adj Close

In [263]:
pdata = pdata.swapaxes('items', 'minor')
pdata['Adj Close']

                  AAPL      DELL        GOOG       MSFT
Date
2010-01-04   28.718094  14.06528         NaN  26.769336
2010-01-05   28.767737  14.38450         NaN  26.777984
2010-01-06   28.310151  14.10397         NaN  26.613650
2010-01-07   28.257821  14.23940         NaN  26.336875
2010-01-08   28.445687  14.36516         NaN  26.518508
2010-01-11   28.194745  14.37483         NaN  26.181189
2010-01-12   27.874037  14.56830         NaN  26.008204
2010-01-13   28.267213  14.57797         NaN  26.250383
2010-01-14   28.103497  14.22005         NaN  26.777984
2010-01-15   27.633830  13.92985         NaN  26.691493
2010-01-19   28.856306  14.32646         NaN  26.899074
2010-01-20   28.412135  14.03626         NaN  26.457964
2010-01-21   27.921004  13.92017         NaN  25.956309
2010-01-22   26.536154  13.18982         NaN  25.048140
2010-01-25   27.250048  13.43650         NaN  25.359512
2010-01-26   27.635174  13.13662         NaN  25.515199
2010-01-27   27.895500  13.08825         NaN  25.662235
2010-01-28   26.742807  12.84641         NaN  25.221125
2010-01-29   25.772608  12.47882         NaN  24.373502
2010-02-01   26.130897  12.78837         NaN  24.572434
2010-02-02   26.282534  12.86576         NaN  24.615679
2010-02-03   26.734757  12.92380         NaN  24.762716
2010-02-04   25.771266  12.58523         NaN  24.079428
2010-02-05   26.228860  12.80772         NaN  24.235114
2010-02-08   26.049045  12.95282         NaN  23.975637
2010-02-09   26.326814  13.10760         NaN  24.226465
2010-02-10   26.183238  13.30107         NaN  24.209166
2010-02-11   26.659611  13.49454         NaN  24.321607
2010-02-12   26.889071  13.38813         NaN  24.157271
2010-02-16   27.294328  13.67834         NaN  24.635203
...                ...       ...         ...        ...
2015-06-17  127.300003       NaN  529.260010  45.970001
2015-06-18  127.879997       NaN  536.729980  46.720001
2015-06-19  126.599998       NaN  536.690002  46.099998
2015-06-22  127.610001       NaN  538.190002  46.230000
2015-06-23  127.029999       NaN  540.479980  45.910000
2015-06-24  128.110001       NaN  537.840027  45.639999
2015-06-25  127.500000       NaN  535.229980  45.650002
2015-06-26  126.750000       NaN  531.690002  45.259998
2015-06-29  124.529999       NaN  521.520020  44.369999
2015-06-30  125.430000       NaN  520.510010  44.150002
2015-07-01  126.599998       NaN  521.840027  44.450001
2015-07-02  126.440002       NaN  523.400024  44.400002
2015-07-06  126.000000       NaN  522.859985  44.389999
2015-07-07  125.690002       NaN  525.020020  44.299999
2015-07-08  122.570000       NaN  516.830017  44.240002
2015-07-09  120.070000       NaN  520.679993  44.520000
2015-07-10  123.279999       NaN  530.130005  44.610001
2015-07-13  125.660004       NaN  546.549988  45.540001
2015-07-14  125.610001       NaN  561.099976  45.619999
2015-07-15  126.820000       NaN  560.219971  45.759998
2015-07-16  128.509995       NaN  579.849976  46.660000
2015-07-17  129.619995       NaN  672.929993  46.619999
2015-07-20  132.070007       NaN  663.020020  46.919998
2015-07-21  130.750000       NaN  662.299988  47.279999
2015-07-22  125.220001       NaN  662.099976  45.540001
2015-07-23  125.160004       NaN  644.280029  46.110001
2015-07-24  124.500000       NaN  623.559998  45.939999
2015-07-27  122.769997       NaN  627.260010  45.349998
2015-07-28  123.379997       NaN  628.000000  45.340000
2015-07-29  122.989998       NaN  631.929993  46.290001

[1422 rows x 4 columns]

In [264]:
pdata.ix[:, '6/1/2012', :]

            Open        High         Low       Close     Volume  Adj Close
AAPL  569.159996  572.649956  560.520012  560.990036  130246900  75.279486
DELL   12.150000   12.300000   12.045000   12.070000   19397600  11.675920
GOOG         NaN         NaN         NaN         NaN        NaN        NaN
MSFT   28.760000   28.959999   28.440001   28.450001   56634300  26.126961

In [265]:
pdata.ix['Adj Close', '5/22/2012':, :]

                  AAPL      DELL        GOOG       MSFT
Date
2012-05-22   74.740031  14.58765         NaN  27.329995
2012-05-23   76.563680  12.08221         NaN  26.733070
2012-05-24   75.860527  12.04351         NaN  26.696335
2012-05-25   75.453926  12.05319         NaN  26.687151
2012-05-28         NaN  12.05319         NaN        NaN
2012-05-29   76.793152  12.24666         NaN  27.146325
2012-05-30   77.719062  12.14992         NaN  26.944289
2012-05-31   77.525831  11.92743         NaN  26.806537
2012-06-01   75.279486  11.67592         NaN  26.126961
2012-06-04   75.722313  11.60821         NaN  26.218794
2012-06-05   75.526394  11.76298         NaN  26.182061
2012-06-06   76.684450  11.81619         NaN  26.953473
2012-06-07   76.719351  11.73396         NaN  26.843270
2012-06-08   77.873386  11.72429         NaN  27.228976
2012-06-11   76.645536  11.47278         NaN  26.540216
2012-06-12   77.315149  11.57919         NaN  26.898372
2012-06-13   76.778382  11.87423         NaN  26.751435
2012-06-14   76.693845  11.93711         NaN  26.944289
2012-06-15   77.042741  11.89841         NaN  27.568765
2012-06-18   78.606065  12.01449         NaN  27.403462
2012-06-19   78.824788  11.78233         NaN  28.193241
2012-06-20   78.600690  11.89841         NaN  28.404460
2012-06-21   77.517783  11.60821         NaN  27.678965
2012-06-22   78.112240  11.80168         NaN  28.193241
2012-06-25   76.591858  11.55500         NaN  27.431013
2012-06-26   76.760939  11.53565         NaN  27.568765
2012-06-27   77.092391  11.92743         NaN  27.706517
2012-06-28   76.361060  11.55984         NaN  27.467746
2012-06-29   78.367204  12.10155         NaN  28.092222
2012-07-02   79.510504  11.98064         NaN  28.064671
...                ...       ...         ...        ...
2015-06-17  127.300003       NaN  529.260010  45.970001
2015-06-18  127.879997       NaN  536.729980  46.720001
2015-06-19  126.599998       NaN  536.690002  46.099998
2015-06-22  127.610001       NaN  538.190002  46.230000
2015-06-23  127.029999       NaN  540.479980  45.910000
2015-06-24  128.110001       NaN  537.840027  45.639999
2015-06-25  127.500000       NaN  535.229980  45.650002
2015-06-26  126.750000       NaN  531.690002  45.259998
2015-06-29  124.529999       NaN  521.520020  44.369999
2015-06-30  125.430000       NaN  520.510010  44.150002
2015-07-01  126.599998       NaN  521.840027  44.450001
2015-07-02  126.440002       NaN  523.400024  44.400002
2015-07-06  126.000000       NaN  522.859985  44.389999
2015-07-07  125.690002       NaN  525.020020  44.299999
2015-07-08  122.570000       NaN  516.830017  44.240002
2015-07-09  120.070000       NaN  520.679993  44.520000
2015-07-10  123.279999       NaN  530.130005  44.610001
2015-07-13  125.660004       NaN  546.549988  45.540001
2015-07-14  125.610001       NaN  561.099976  45.619999
2015-07-15  126.820000       NaN  560.219971  45.759998
2015-07-16  128.509995       NaN  579.849976  46.660000
2015-07-17  129.619995       NaN  672.929993  46.619999
2015-07-20  132.070007       NaN  663.020020  46.919998
2015-07-21  130.750000       NaN  662.299988  47.279999
2015-07-22  125.220001       NaN  662.099976  45.540001
2015-07-23  125.160004       NaN  644.280029  46.110001
2015-07-24  124.500000       NaN  623.559998  45.939999
2015-07-27  122.769997       NaN  627.260010  45.349998
2015-07-28  123.379997       NaN  628.000000  45.340000
2015-07-29  122.989998       NaN  631.929993  46.290001

[815 rows x 4 columns]

In [266]:
stacked = pdata.ix[:, '5/30/2012':, :].to_frame()
stacked

                        Open        High         Low       Close     Volume  \
Date       minor
2012-05-30 AAPL   569.200050  579.989990  566.559990  579.169998  132357400
           DELL    12.590000   12.700000   12.460000   12.560000   19787800
           MSFT    29.350000   29.480000   29.120001   29.340000   41585500
2012-05-31 AAPL   580.740021  581.499985  571.459969  577.730019  122918600
           DELL    12.530000   12.540000   12.330000   12.330000   19955600
           MSFT    29.299999   29.420000   28.940001   29.190001   39134000
2012-06-01 AAPL   569.159996  572.649956  560.520012  560.990036  130246900
           DELL    12.150000   12.300000   12.045000   12.070000   19397600
           MSFT    28.760000   28.959999   28.440001   28.450001   56634300
2012-06-04 AAPL   561.500008  567.499985  548.499977  564.290031  139248900
           DELL    12.110000   12.112500   11.800000   12.000000   17015700
           MSFT    28.620001   28.780001   28.320000   28.549999   47926300
2012-06-05 AAPL   561.269989  566.470055  558.330002  562.830025   97053600
           DELL    11.950000   12.240000   11.950000   12.160000   15620900
           MSFT    28.510000   28.750000   28.389999   28.510000   45715400
2012-06-06 AAPL   567.770004  573.849983  565.499992  571.459969  100363900
           DELL    12.210000   12.280000   12.090000   12.215000   20779900
           MSFT    28.879999   29.370001   28.809999   29.350000   46860500
2012-06-07 AAPL   577.290009  577.320023  570.500000  571.720055   94941700
           DELL    12.320000   12.410000   12.120000   12.130000   20074000
           MSFT    29.639999   29.700001   29.170000   29.230000   37792800
2012-06-08 AAPL   571.599998  580.580017  568.999992  580.320038   86879100
           DELL    12.130000   12.225000   12.020000   12.120000   18155600
           MSFT    29.209999   29.680000   29.049999   29.650000   42551100
2012-06-11 AAPL   587.719994  588.499985  570.629990  571.169975  147816200
           DELL    12.150000   12.200000   11.820000   11.860000   16931900
           MSFT    29.730000   29.809999   28.820000   28.900000   46361900
2012-06-12 AAPL   574.459984  576.620033  566.699966  576.159996  108845100
           DELL    11.910000   12.010000   11.680000   11.970000   17608100
           MSFT    29.100000   29.299999   28.840000   29.290001   35337900
...                      ...         ...         ...         ...        ...
2015-07-16 AAPL   127.739998  128.570007  127.349998  128.509995   35866800
           GOOG   565.119995  580.679993  565.000000  579.849976    4053900
           MSFT    46.009998   46.689999   45.970001   46.660000   25894400
2015-07-17 AAPL   129.080002  129.619995  128.309998  129.619995   45693300
           GOOG   649.000000  674.468018  645.000000  672.929993   11134500
           MSFT    46.549999   46.779999   46.259998   46.619999   29262900
2015-07-20 AAPL   130.970001  132.970001  130.699997  132.070007   54159800
           GOOG   659.239990  668.880005  653.010010  663.020020    5848800
           MSFT    46.650002   47.130001   46.439999   46.919998   30271200
2015-07-21 AAPL   132.850006  132.919998  130.320007  130.750000   58898800
           GOOG   655.210022  673.000000  654.299988  662.299988    3348400
           MSFT    46.779999   47.330002   46.480000   47.279999   41205000
2015-07-22 AAPL   121.989998  125.500000  121.989998  125.220001  114692800
           GOOG   660.890015  678.640015  659.000000  662.099976    3689600
           MSFT    45.439999   46.930000   45.200001   45.540001   58724600
2015-07-23 AAPL   126.199997  127.089996  125.059998  125.160004   50688700
           GOOG   661.270020  663.630005  641.000000  644.280029    3001800
           MSFT    45.270000   46.230000   45.099998   46.110001   33465600
2015-07-24 AAPL   125.320000  125.739998  123.900002  124.500000   41051600
           GOOG   647.000000  648.169983  622.520020  623.559998    3608400
           MSFT    45.910000   46.320000   45.799999   45.939999   32077000
2015-07-27 AAPL   123.089996  123.610001  122.120003  122.769997   44274800
           GOOG   621.000000  634.299988  620.500000  627.260010    2668700
           MSFT    45.939999   46.009998   45.250000   45.349998   39189900
2015-07-28 AAPL   123.379997  123.910004  122.550003  123.379997   33448900
           GOOG   632.830017  632.830017  623.309998  628.000000    1704300
           MSFT    45.580002   45.639999   44.790001   45.340000   34177100
2015-07-29 AAPL   123.150002  123.500000  122.269997  122.989998   35914200
           GOOG   628.799988  633.359985  622.650024  631.929993    1565000
           MSFT    45.400002   46.779999   45.259998   46.290001   40360400

                   Adj Close
Date       minor
2012-05-30 AAPL    77.719062
           DELL    12.149920
           MSFT    26.944289
2012-05-31 AAPL    77.525831
           DELL    11.927430
           MSFT    26.806537
2012-06-01 AAPL    75.279486
           DELL    11.675920
           MSFT    26.126961
2012-06-04 AAPL    75.722313
           DELL    11.608210
           MSFT    26.218794
2012-06-05 AAPL    75.526394
           DELL    11.762980
           MSFT    26.182061
2012-06-06 AAPL    76.684450
           DELL    11.816190
           MSFT    26.953473
2012-06-07 AAPL    76.719351
           DELL    11.733960
           MSFT    26.843270
2012-06-08 AAPL    77.873386
           DELL    11.724290
           MSFT    27.228976
2012-06-11 AAPL    76.645536
           DELL    11.472780
           MSFT    26.540216
2012-06-12 AAPL    77.315149
           DELL    11.579190
           MSFT    26.898372
...                      ...
2015-07-16 AAPL   128.509995
           GOOG   579.849976
           MSFT    46.660000
2015-07-17 AAPL   129.619995
           GOOG   672.929993
           MSFT    46.619999
2015-07-20 AAPL   132.070007
           GOOG   663.020020
           MSFT    46.919998
2015-07-21 AAPL   130.750000
           GOOG   662.299988
           MSFT    47.279999
2015-07-22 AAPL   125.220001
           GOOG   662.099976
           MSFT    45.540001
2015-07-23 AAPL   125.160004
           GOOG   644.280029
           MSFT    46.110001
2015-07-24 AAPL   124.500000
           GOOG   623.559998
           MSFT    45.939999
2015-07-27 AAPL   122.769997
           GOOG   627.260010
           MSFT    45.349998
2015-07-28 AAPL   123.379997
           GOOG   628.000000
           MSFT    45.340000
2015-07-29 AAPL   122.989998
           GOOG   631.929993
           MSFT    46.290001

[2300 rows x 6 columns]

In [267]:
stacked.to_panel()

<class 'pandas.core.panel.Panel'>
Dimensions: 6 (items) x 809 (major_axis) x 4 (minor_axis)
Items axis: Open to Adj Close
Major_axis axis: 2012-05-30 00:00:00 to 2015-07-29 00:00:00
Minor_axis axis: AAPL to MSFT